Práctica4/httperf/httperf-haproxy.txt
cvi096063:~ Apozo$ httperf --server 10.211.55.33 --port 80 --uri /index.html --rate 150 --num-conn 2700 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=10.211.55.33 --port=80 --uri=/index.html --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=2700 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 2700 requests 2700 replies 2700 test-duration 17.994 s

Connection rate: 150.0 conn/s (6.7 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 0.5 avg 0.7 max 1.5 median 0.5 stddev 0.1
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 150.0 req/s (6.7 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 150.0 avg 150.0 max 150.0 stddev 0.0 (3 samples)
Reply time [ms]: response 0.6 transfer 0.0
Reply size [B]: header 254.0 content 11590.0 footer 0.0 (total 11844.0)
Reply status: 1xx=0 2xx=2700 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.89 system 13.06 (user 27.2% system 72.6% total 99.8%)
Net I/O: 1746.5 KB/s (14.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
cvi096063:~ Apozo$ 
cvi096063:~ Apozo$ 
cvi096063:~ Apozo$ 
[...]
cvi096063:~ Apozo$ httperf --server 10.211.55.33 --port 80 --uri /index.html --rate 150 --num-conn 2700 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=10.211.55.33 --port=80 --uri=/index.html --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=2700 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 2700 requests 2700 replies 2700 test-duration 17.994 s

Connection rate: 150.0 conn/s (6.7 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 0.5 avg 0.8 max 10.2 median 0.5 stddev 0.4
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 150.0 req/s (6.7 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 150.0 avg 150.0 max 150.0 stddev 0.0 (3 samples)
Reply time [ms]: response 0.6 transfer 0.0
Reply size [B]: header 254.0 content 11590.0 footer 0.0 (total 11844.0)
Reply status: 1xx=0 2xx=2700 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.85 system 13.05 (user 26.9% system 72.5% total 99.5%)
Net I/O: 1746.5 KB/s (14.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
cvi096063:~ Apozo$ 
cvi096063:~ Apozo$ 
cvi096063:~ Apozo$ 
[...]
cvi096063:~ Apozo$ httperf --server 10.211.55.33 --port 80 --uri /index.html --rate 150 --num-conn 2700 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=10.211.55.33 --port=80 --uri=/index.html --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=2700 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 3

Total: connections 2700 requests 2700 replies 2700 test-duration 17.995 s

Connection rate: 150.0 conn/s (6.7 ms/conn, <=4 concurrent connections)
Connection time [ms]: min 0.5 avg 0.7 max 23.3 median 0.5 stddev 0.5
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 150.0 req/s (6.7 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 150.0 avg 150.0 max 150.0 stddev 0.0 (3 samples)
Reply time [ms]: response 0.6 transfer 0.0
Reply size [B]: header 254.0 content 11590.0 footer 0.0 (total 11844.0)
Reply status: 1xx=0 2xx=2700 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.91 system 13.02 (user 27.3% system 72.3% total 99.6%)
Net I/O: 1746.5 KB/s (14.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
cvi096063:~ Apozo$ 
cvi096063:~ Apozo$ 
cvi096063:~ Apozo$ 
[...]
cvi096063:~ Apozo$ httperf --server 10.211.55.33 --port 80 --uri /index.html --rate 150 --num-conn 2700 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=10.211.55.33 --port=80 --uri=/index.html --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=2700 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 7

Total: connections 2700 requests 2700 replies 2700 test-duration 17.994 s

Connection rate: 150.0 conn/s (6.7 ms/conn, <=8 concurrent connections)
Connection time [ms]: min 0.5 avg 0.8 max 49.1 median 0.5 stddev 0.9
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 150.0 req/s (6.7 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 150.0 avg 150.0 max 150.0 stddev 0.0 (3 samples)
Reply time [ms]: response 0.6 transfer 0.0
Reply size [B]: header 254.0 content 11590.0 footer 0.0 (total 11844.0)
Reply status: 1xx=0 2xx=2700 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.88 system 13.01 (user 27.1% system 72.3% total 99.4%)
Net I/O: 1746.5 KB/s (14.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
cvi096063:~ Apozo$ 
cvi096063:~ Apozo$ 
cvi096063:~ Apozo$ 
[...]
cvi096063:~ Apozo$ httperf --server 10.211.55.33 --port 80 --uri /index.html --rate 150 --num-conn 2700 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=10.211.55.33 --port=80 --uri=/index.html --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=2700 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 4

Total: connections 2700 requests 2700 replies 2700 test-duration 17.994 s

Connection rate: 150.0 conn/s (6.7 ms/conn, <=5 concurrent connections)
Connection time [ms]: min 0.5 avg 0.8 max 29.6 median 0.5 stddev 0.7
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 150.0 req/s (6.7 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 150.0 avg 150.0 max 150.0 stddev 0.0 (3 samples)
Reply time [ms]: response 0.6 transfer 0.0
Reply size [B]: header 254.0 content 11590.0 footer 0.0 (total 11844.0)
Reply status: 1xx=0 2xx=2700 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.86 system 13.03 (user 27.0% system 72.4% total 99.4%)
Net I/O: 1746.5 KB/s (14.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
cvi096063:~ Apozo$